BasicProbability.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Basic Probability</title>
<!-- 2014-09-25 Thu 21:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Thompson" />
</head>
<body>
<div id="content">
<h1 class="title">Basic Probability</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Definition</a></li>
<li><a href="#sec-2">2. Overview</a></li>
<li><a href="#sec-3">3. Vocabulary</a>
<ul>
<li><a href="#sec-3-1">3.1. Probability Density and Distribution</a></li>
<li><a href="#sec-3-2">3.2. Expectation</a></li>
<li><a href="#sec-3-3">3.3. Moment</a></li>
<li><a href="#sec-3-4">3.4. Variance</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Definition</a></li>
<li><a href="#sec-3-4-2">3.4.2. Derivation</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Covariance</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Definition</a></li>
<li><a href="#sec-3-5-2">3.5.2. Derivation</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Correlation</a></li>
<li><a href="#sec-3-7">3.7. Joint and Conditional Probability</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1. Joint Probabilty</a></li>
<li><a href="#sec-3-7-2">3.7.2. Conditional Probability</a></li>
<li><a href="#sec-3-7-3">3.7.3. Relationships</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8. Noise</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Discrete Version of terms</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Definition</h2>
<div class="outline-text-2" id="text-1">
<p>
Two camps: 
</p>

<p>
<b>frequentists</b> believe probability is the ratio of outcome/possible
 outcomes after infinite trials
</p>

<p>
<b>bayesians</b> believe that probablity is a measure of belief of an
 outcome
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overview</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Vocabulary</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Probability Density and Distribution</h3>
<div class="outline-text-3" id="text-3-1">
<p>
density = continuous <br  />
distribution = discrete <br  />
P(x) = probability of variable X taking value x <br  />
P(X) = probabilty density (or distribution) function
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Expectation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is the <b>expected value</b> average many repetitions. This depends on
the 1) probability of one possible result and 2) the value of that
result. So the expectation of a die roll is 3.5 because all events are
equally likely and the larger numbers represent a larger proportion of
summated outcomes.
</p>

<p>
So the Expectation of X given a probability distribution P(X) would be
</p>

\begin{equation}
E[X] = \sum_{i=1}^{N} X P(X)
\end{equation}

<p>
This is equivalent to the concept of a <b>mean</b> or center of the distribution.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Moment</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A moment gives information about a shape of a group of points. The nth
moment about point c is given by the equation:
</p>

\begin{equation}
u_n = \int{(x - c)^2 f(x) dx}
\end{equation}

<p>
When the concept of a moment is applied to a probility density
function the <b>zeroth moment</b> is the sum of all probabilities (1), and the <b>first moment</b> is the <b>mean</b>.
</p>

<p>
After the first moment, the <b>central moment</b> where c = mean, is used to get
distribution of data around the mean.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Variance</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Definition</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
The variance is equal to the second central moment about the
mean. Average of the square of each value from the mean.
</p>

<p>
The standard deviation is the square root of the variance. This value
is more difficult to mathematically manipulate, but has the same units
as the mean.
</p>
</div>
</div>

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Derivation</h4>
<div class="outline-text-4" id="text-3-4-2">
\begin{align}
u_2 &= \int{(x-c)^n f(x) dx} \\
&= \int{(x-u)^n f(x) dx} \\
&= \int{(x^2 - 2ux + u^2) f(x) dx} \\
&= \int{(x^2 f(x) dx} - \int{2u x f(x) dx} + \int{u^2 f(x) dx} \\
&= E[x^2] - 2u \int{x f(x) dx} + u^2 \int{f(x) dx} \\
&= E[x^2] - 2u (u) + u^2 (1) \\
&= E[x^2] - 2u^2 + u^2 \\
&= E[x^2] - u^2 \\
\sigma^2 &= E[x^2] - E[x]^2 = E[(x-E[x])^2]
\end{align}
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Covariance</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Definition</h4>
<div class="outline-text-4" id="text-3-5-1">
\begin{equation}
\sigma(x,y) = E[(x-E[x])(y-E[x])]
\end{equation}

<p>
How much variables change together.
</p>

<p>
Independent variables have a covariance = 0 (E[xy] will equal
E[x]E[y]).
</p>

<p>
A covariance of 0 does not imply independence because it can only
speak to <b>linear</b> dependence.
</p>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Derivation</h4>
<div class="outline-text-4" id="text-3-5-2">
\begin{align}
\sigma(x,y) &= E[(x-E[x])(y-E[y])] \\
&= E[xy - xE[y] - yE[x] + E[x]E[y]] \\
&= E[xy] - E[xE[y]] - E[yE[x]] + E[E[x]E[y]] \\
&= E[xy] - E[x]E[y] - E[x]E[y] + E[x]E[y] \\
&= E[xy] - E[x]E[y]
\end{align}
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Correlation</h3>
<div class="outline-text-3" id="text-3-6">
\begin{equation}
\rho(x,y) = E[(x-E[x])(y-E[y])] / (\sigma(x)\sigma(y)) = cov(x,y) /  (\sigma(x)\sigma(y))
\end{equation}

<p>
Dimensionless and therefore doesn't change as a result of units used
to calculate it.
</p>
</div>
</div>








<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Joint and Conditional Probability</h3>
<div class="outline-text-3" id="text-3-7">
</div><div id="outline-container-sec-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> Joint Probabilty</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
P(x,y) is the probability that x and y both occur
</p>
</div>
</div>

<div id="outline-container-sec-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> Conditional Probability</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
P(x|y) is the probability that x occurs when y occurs <br  />
P(y|x) is the probability that y occurs when x occurs <br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-7-3" class="outline-4">
<h4 id="sec-3-7-3"><span class="section-number-4">3.7.3</span> Relationships</h4>
<div class="outline-text-4" id="text-3-7-3">
\begin{equation}
P(x,y) = P(x|y)P(y) = P(y|x)P(x)
\end{equation}

<p>
The probability of x and y occuring is the same of the probability
that y occurs multiplied by the probability that x occurs when y
occurs.
</p>

<p>
If they are independent of one another:
</p>

\begin{equation}
P(x|y) = P(x) , P(y|x) = P(y)
\end{equation}

<p>
Therefore P(x,y) = P(x)P(y) if x and y are independent.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Noise</h3>
<div class="outline-text-3" id="text-3-8">
<p>
N(0,Q) -&gt; represents noise that is zero mean normal distribution
(first value) and that has a variance N.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Discrete Version of terms</h2>
<div class="outline-text-2" id="text-4">
<p>
With enough samples, we don't want to have to do all of those integral
and can instead perform these approximations of sums
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Thompson</p>
<p class="date">Created: 2014-09-25 Thu 21:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>